export default [
  {
    titlePrimary: 'UTC Wallet用户使用协议',
    content: [
      '依据本协议（定义见下文）的规定为在使用UTC Wallet的用户（以下简称“用户”）提供服务，本协议在用户和平台之间具有法律约束力。平台在此特别提醒用户认真阅读并充分理解本协议项下的各条款，特别是本协议中涉及免除或限制平台责任的条款，以及排除或限制用户权利的条款。用户应当审慎阅读，并选择接受或不接受本协议。除非用户接受本协议项下的所有条款，否则用户无权使用平台基于本协议所提供的服务。若用户不同意本协议的内容，或拒绝承认平台随时对本协议进行单方修改的权利，则用户应当立即停止使用并不再访问本平台。用户一经使用本钱或使用平台服务即视为对本协议全部条款（包括本公司对本协议随时做出的任何修改）充分理解并完全接受。',
      '为了本协议表述之方便，本平台在本协议中合称使用“我们”或其他第一人称称呼；访问平台的自然人或其他主体均称为“用户/您”或其他第二人称；我们和用户在本协议中合称为“双方”，我们或用户称为“一方”。',
    ],
  },
  {
    title: '平台基本条款：',
    content: [
      '平台系数字资产安全管理服务平台，平台服务是由本公司通过平台及客户端等各种方式向用户提供的服务，具体服务内容主要包括：数字资产安全管理服务、数字资产交易信息发布、用户服务等辅助服务，具体详情平台实际提供的服务内容为准。',
      '为了保障用户的权益，用户在自愿使用平台服务前，必须仔细阅读并充分理解知悉本服务协议所有条款。一经使用平台服务，即视为对本协议和平台对本协议随时做出的任何修改的充分理解和接受；如有违反而导致任何法律后果，用户将自己独立承担相应的法律责任。',
      '在本协议履行过程中，平台可根据情况对本协议进行修改。一旦本协议的内容发生变动，平台将公布最新的服务协议，不再向用户作个别通知。如果用户不同意平台对本协议所做的修改，用户有权停止使用平台服务。如果用户继续使用平台服务，则视为用户接受平台对本协议所做的修改，并应遵照修改后的协议执行。',
      '平台对于用户的通知及任何其他的协议、告示或其他关于用户使用服务的通知，用户同意平台可通过平台公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人（如以邮寄方式向用户发出通知的，则在该等通知按照用户在平台留存的联系地址交邮后的第三个自然日即视为送达）。因不可归责于平台的原因（包括电子邮件地址、手机号码、联系地址等不准确或无效、信息传输故障等）导致用户未在前述通知视为送达之日收到该等通知的，平台不承担任何责任。',
      '为了尽可能避免任何对货币钱包的误操作或数字代币的任何安全风险，用户应避免在不具备区块链基础知识的前提下使用平台。对不具备区块链基础知识的用户，本公司有权拒绝提供部分或全部的服务功能。',
      '创建钱包的个人用户应当是年满十八岁或根据其所在国法律规定具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人',
      '欲创建钱包的法人、组织或其他机构，应当指定年满十八岁或根据其所在国法律规定具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人代表机构完成钱包创建。',
      '用户创建钱包时，会显示本协议选项，用户一旦点击同意按钮，即表示用户或用户有权代理的机构同意本协议的全部内容，且用户本人或用户所代理的机构受到本协议之约束。若用户不具备本协议第十五条或第十六条所要求之主体资格，则用户及用户有权代理的机构应承担因此而导致的一切后果，且平台保留向用户及用户有权代理机构追究责任的权利。',
      '在创建钱包前或者创建钱包后，平台有权根据用户所在国家或地区的法律法规、规则、命令等规范的要求，拒绝向用户提供服务。本钱包为去中心化钱包，钱包和平台不承诺保管和找回钱包功能，请自行妥善保管和备份私钥或助记词。',
    ],
  },
  {
    title: '用户在此承诺以下事项：',
    content: [
      '(一) 出于合法目的创建钱包及使用本平台服务，且不具有以平台为媒介违反法律法规之意图；',
      '(二) 用户保证存入UTC钱包的数字资产来源合法；',
      '(三) 除本协议以外，用户应同时遵守平台不时发布及更新的全部规则，包括公告、使用流程说明、风险提示等。',
    ],
  },
  {
    title:
      '用户理解存在如下情形时，本公司将暂停提供服务（或在发生如下情形时彻底终止服务）：',
    content: [
      '(一) 因设备、区块链系统维修、升级、故障和通信中断等技术原因而中断平台的运营；',
      '(二) 因不可抗力等因素造成平台不能提供服务平台合理认为继续提供服务会有较大风险的；',
      '(三) 适用法律或政策发生重大不利变化的；',
      '(四) 发生平台无法控制或合理预见的其他情形',
    ],
  },
  {
    title: '若用户违背本协议第十九之承诺：',
    content: [
      '(一) 平台有权停止或拒绝用户使用平台服务的部份或全部功能。在此情况下，平台不承担任何责任，并且用户同意负担因此所产生的直接或间接的任何支出或损失；',
      '(二) 用户应当承担因违背承诺而产生的任何直接或间接损失及不利后果，且平台保留追究用户责任的权利。',
    ],
  },
  {
    title:
      '用户理解存在如下情形时，本公司将暂停提供服务（或在发生如下情形时彻底终止服务）：',
    content: [
      '(一) 因设备、区块链系统维修、升级、故障和通信中断等技术原因而中断平台的运营；',
      '(二) 因不可抗力等因素造成平台不能提供服务平台合理认为继续提供服务会有较大风险的；',
      '(三) 适用法律或政策发生重大不利变化的；',
      '(四) 发生平台无法控制或合理预见的其他情形',
    ],
  },
  {
    title: '其他协议、规则和指引',
    content: [
      '用户可以选择使用平台的不同语言版本，若存在平台的不同语言版本之内容不一致或者相冲突，或遗漏内容之情形，平台的中文文本应当优先适用。',
    ],
  },
];
